using System;
using static Algorithms.Verification;

namespace Algorithms
{
    public class Lesson01
    {

        public static void GetMenuLesson()
        {
            Console.Clear();
            Console.WriteLine("Список домашних заданий Урока №1:\n");
            Console.WriteLine("1. Индекс массы тела\n" +
                "2. Максимальное из четырех чисел\n" +
                "3. Обмен значениями двух целочисленных переменных\n" +
                "4. Нахождение корня заданного квадратного уравнения\n" +
                "5. Определение времени года по номеру месяца\n" +
                "6. Добавление слов (год, года, лет) к указанному возрасту\n" +
                "7. Определение цвета по координатам на шахмотной доске\n" +
                "8. Вывод квадаратов и кубов чисел от A до B\n" +
                "9. Нахождения частного и остатка с помощью сложения и вычитания\n" +
                "10. Определение нахождения в записи числа N нечетных цифр\n" +
                "11. Среднее арифметическое всех положительных чисел, оканчивающихся на 8\n" +
                "12. Функция нахождения максимального из трех чисел\n" +
                "13. Генерация случайных чисел от 1 до 100\n" +
                "14. Вывод всех автоморфных чисел, не превосходящие N\n");

            int _choice = GetInt("Введите номер домашнего задания:\n");

            switch (_choice)
            {
                case 1:

                    break;
                case 2:

                    break;
                case 3:

                    break;
                case 4:

                    break;
                case 5:

                    break;
                case 6:

                    break;
                case 7:

                    break;
                case 8:

                    break;
                case 9:

                    break;
                case 10:

                    break;
                case 11:

                    break;
                case 12:

                    break;
                case 13:

                    break;
                case 14:

                    break;

                    //default:
            }
        }
    
    }
}
